Autodesk.Revit.DB.DirectShapeType.AddReferenceCurve(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.DirectShapeReferenceOptions)
Adds a reference curve to the DirectShapeType.
Remarks:
There are two cases to consider:
The input curve's bounds are set. The resulting reference curve that is added to the DirectShapeType will be displayed with those bounds.
Note that the specified bounds must not be degenerate. Permitted curve types are those for which Autodesk::Revit::DB::DirectShapeType::isValidReferenceCurve returns true.  The input curve is unbounded. Reasonable bounds are automatically calculated and applied to the input curve.
The automatic bounds are based on the host DirectShapeType's geometry.
Note that only lines and splines may be unbounded. You must specify valid bounds for all other curve types.
refCurve:
The geometry of the new reference curve.
options:
The options that are used to configure the new reference curve.
Throws Autodesk.Revit.Exceptions.ArgumentException:
refCurve cannot be used for creating a reference curve.
-or-
options cannot be used to add a reference object to this DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeType.AddReferenceCurve(Autodesk.Revit.DB.Curve)
Adds a reference curve to the DirectShapeType.
Remarks:
There are two cases to consider:
The input curve's bounds are set. The resulting reference curve that is added to the DirectShapeType will be displayed with those bounds.
Note that the specified bounds must not be degenerate. Permitted curve types are those for which Autodesk::Revit::DB::DirectShapeType::isValidReferenceCurve returns true.  The input curve is unbounded. Reasonable bounds are automatically calculated and applied to the input curve.
The automatic bounds are based on the host DirectShapeType's geometry.
Note that only lines and splines may be unbounded. You must specify valid bounds for all other curve types.
refCurve:
The geometry of the new reference curve.
Throws Autodesk.Revit.Exceptions.ArgumentException:
refCurve cannot be used for creating a reference curve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShapeType.SetShape(System.Collections.Generic.IList{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.DirectShapeTargetViewType)
Builds the type shape from the supplied collection of GeometryObjects. The objects are copied.
If the new shape is identical to the old one, the old shape will be kept.
pGeomArr:
Shape of this object expressed as a collection of GeometryObjects. These will be copied.
Shape and Category should be consistent: geometry supplied as shape should be valid for the Category
the type object is associated with.
For viewType = DirectShapeTargetViewType::Default, the supported types of GeometryObjects are: Solid, Mesh, GeometryInstance, Point and Curve.
For viewType = DirectShapeTargetViewType::Plan, the supported types of GeometryObjects are: Point and Curve
viewType:
Specifies which target view type to associate the geometry with. The target view type will
decide which views can show this geometry.
Throws Autodesk.Revit.Exceptions.ArgumentException:
At least one member of pGeomArr does not satisfy DirectShapeType validation criteria.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2025